{
  "format": "graph-model",
  "generatedBy": "2.19.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "signature": {
    "inputs": {
      "keras_tensor_272": {
        "name": "keras_tensor_272:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            { "size": "-1" },
            { "size": "28" },
            { "size": "28" },
            { "size": "1" }
          ]
        }
      }
    },
    "outputs": {
      "output_0": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "10" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/sequential_7_1/rescaling_1/Cast/x",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/rescaling_1/Cast_1/x",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_1/convolution/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "1" },
                  { "size": "8" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_1/Squeeze",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "8" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_1_2/convolution/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "8" },
                  { "size": "8" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_1_2/Squeeze",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "8" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_2_1/convolution/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "8" },
                  { "size": "16" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_2_1/Squeeze",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_3_1/convolution/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "16" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_3_1/Squeeze",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_4_1/convolution/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_4_1/Squeeze",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_5_1/convolution/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_5_1/Squeeze",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/flatten_1/Reshape/shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/dense_1/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "288" }, { "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/dense_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/dense_1_2/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }, { "size": "10" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/dense_1_2/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "10" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "keras_tensor_272",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "28" },
                { "size": "28" },
                { "size": "1" }
              ]
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/rescaling_1/mul",
        "op": "Mul",
        "input": [
          "keras_tensor_272",
          "StatefulPartitionedCall/sequential_7_1/rescaling_1/Cast/x"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/rescaling_1/add",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/sequential_7_1/rescaling_1/mul",
          "StatefulPartitionedCall/sequential_7_1/rescaling_1/Cast_1/x"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_1/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_7_1/rescaling_1/add",
          "StatefulPartitionedCall/sequential_7_1/conv2d_1/convolution/ReadVariableOp",
          "StatefulPartitionedCall/sequential_7_1/conv2d_1/Squeeze"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": { "i": "0" },
          "data_format": { "s": "TkhXQw==" },
          "filter_format": { "s": "SFdJTw==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "padding": { "s": "U0FNRQ==" },
          "use_cudnn_on_gpu": { "b": true },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_1_2/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_7_1/conv2d_1/Relu",
          "StatefulPartitionedCall/sequential_7_1/conv2d_1_2/convolution/ReadVariableOp",
          "StatefulPartitionedCall/sequential_7_1/conv2d_1_2/Squeeze"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": { "i": "0" },
          "data_format": { "s": "TkhXQw==" },
          "filter_format": { "s": "SFdJTw==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "padding": { "s": "U0FNRQ==" },
          "use_cudnn_on_gpu": { "b": true },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/max_pooling2d_1/MaxPool2d",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_7_1/conv2d_1_2/Relu"],
        "attr": {
          "padding": { "s": "VkFMSUQ=" },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_2_1/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_7_1/max_pooling2d_1/MaxPool2d",
          "StatefulPartitionedCall/sequential_7_1/conv2d_2_1/convolution/ReadVariableOp",
          "StatefulPartitionedCall/sequential_7_1/conv2d_2_1/Squeeze"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": { "i": "0" },
          "data_format": { "s": "TkhXQw==" },
          "filter_format": { "s": "SFdJTw==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "padding": { "s": "U0FNRQ==" },
          "use_cudnn_on_gpu": { "b": true },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_3_1/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_7_1/conv2d_2_1/Relu",
          "StatefulPartitionedCall/sequential_7_1/conv2d_3_1/convolution/ReadVariableOp",
          "StatefulPartitionedCall/sequential_7_1/conv2d_3_1/Squeeze"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": { "i": "0" },
          "data_format": { "s": "TkhXQw==" },
          "filter_format": { "s": "SFdJTw==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "padding": { "s": "U0FNRQ==" },
          "use_cudnn_on_gpu": { "b": true },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/max_pooling2d_1_2/MaxPool2d",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_7_1/conv2d_3_1/Relu"],
        "attr": {
          "padding": { "s": "VkFMSUQ=" },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_4_1/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_7_1/max_pooling2d_1_2/MaxPool2d",
          "StatefulPartitionedCall/sequential_7_1/conv2d_4_1/convolution/ReadVariableOp",
          "StatefulPartitionedCall/sequential_7_1/conv2d_4_1/Squeeze"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": { "i": "0" },
          "data_format": { "s": "TkhXQw==" },
          "filter_format": { "s": "SFdJTw==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "padding": { "s": "U0FNRQ==" },
          "use_cudnn_on_gpu": { "b": true },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/conv2d_5_1/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_7_1/conv2d_4_1/Relu",
          "StatefulPartitionedCall/sequential_7_1/conv2d_5_1/convolution/ReadVariableOp",
          "StatefulPartitionedCall/sequential_7_1/conv2d_5_1/Squeeze"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": { "i": "0" },
          "data_format": { "s": "TkhXQw==" },
          "filter_format": { "s": "SFdJTw==" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "padding": { "s": "U0FNRQ==" },
          "use_cudnn_on_gpu": { "b": true },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/max_pooling2d_2_1/MaxPool2d",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_7_1/conv2d_5_1/Relu"],
        "attr": {
          "padding": { "s": "VkFMSUQ=" },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/flatten_1/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/sequential_7_1/max_pooling2d_2_1/MaxPool2d",
          "StatefulPartitionedCall/sequential_7_1/flatten_1/Reshape/shape"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "Tshape": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/dense_1/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_7_1/flatten_1/Reshape",
          "StatefulPartitionedCall/sequential_7_1/dense_1/Cast/ReadVariableOp",
          "StatefulPartitionedCall/sequential_7_1/dense_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "leakyrelu_alpha": { "f": 0.2 },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/dense_1_2/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_7_1/dense_1/Relu",
          "StatefulPartitionedCall/sequential_7_1/dense_1_2/Cast/ReadVariableOp",
          "StatefulPartitionedCall/sequential_7_1/dense_1_2/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "leakyrelu_alpha": { "f": 0.2 },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7_1/dense_1_2/Softmax",
        "op": "Softmax",
        "input": ["StatefulPartitionedCall/sequential_7_1/dense_1_2/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/sequential_7_1/dense_1_2/Softmax"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 2129 }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "StatefulPartitionedCall/sequential_7_1/rescaling_1/Cast/x",
          "shape": [],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/rescaling_1/Cast_1/x",
          "shape": [],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/conv2d_1/convolution/ReadVariableOp",
          "shape": [3, 3, 1, 8],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/conv2d_1/Squeeze",
          "shape": [8],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/conv2d_1_2/convolution/ReadVariableOp",
          "shape": [3, 3, 8, 8],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/conv2d_1_2/Squeeze",
          "shape": [8],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/conv2d_2_1/convolution/ReadVariableOp",
          "shape": [3, 3, 8, 16],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/conv2d_2_1/Squeeze",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/conv2d_3_1/convolution/ReadVariableOp",
          "shape": [3, 3, 16, 16],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/conv2d_3_1/Squeeze",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/conv2d_4_1/convolution/ReadVariableOp",
          "shape": [3, 3, 16, 32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/conv2d_4_1/Squeeze",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/conv2d_5_1/convolution/ReadVariableOp",
          "shape": [3, 3, 32, 32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/conv2d_5_1/Squeeze",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/flatten_1/Reshape/shape",
          "shape": [2],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/dense_1/Cast/ReadVariableOp",
          "shape": [288, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/dense_1/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/dense_1_2/Cast/ReadVariableOp",
          "shape": [128, 10],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7_1/dense_1_2/BiasAdd/ReadVariableOp",
          "shape": [10],
          "dtype": "float32"
        }
      ]
    }
  ]
}
